hearts = ['❤️', '🖤', '🤎', '💜']
roles = {'⚔️': 'дд', 
         '🛡': 'танк',
         '🔮': 'хил'}

subroles_emojies = ['⛩']

states = {
    '🔄': 'unplatformed',
    '🌑': 'darked',
    '🌕': 'golded',
    '💩': 'pooped',
    '⚗️': 'phyz',
    '🧪': 'mag',
    '🌡': 'mob_orb',
    '✨': 'baffed',
    '🤢': 'poisoned',
    '🩸': 'blood',
    '🌫': 'unconcentrated',
    '😪': 'sleep',
    '♦️': 'papped',

    '😡': 'fired',
    '☠️': 'deathed',
    '🌀': 'otrek',
    '👁': 'watched',

    '🔥': 'untanked'
}

ragna_id = 512187187
profile_button = '😏Профиль'
ragna_username = 'ragna_bot'

monk_list = ['воскресить усопших', 'помолиться за души мёртвых']

stand_still = ['cтоять смирно', 'оцепенеть', 'не шевелиться', 'замереть']

beams = ['🟡','🔴','🟢']

dl_p1 = [
    'выносить', 'долбить', 'избивать', 'штурмовать', 'уничтожать', 'мочить', 'атачить', 'атака', 'атаковать', 'ударять',
    'бить', 'жарить', 'штурмовать', 'драть']
dl_p2 = ['основного', 'главного', 'рагну', 'гиганта', 'монстра', 'босса', 'главаря', 'гиганта']

tl_p1 = ['защищать', 'дефать', 'дефить', 'оборонять']
tl_p2 = ['коллег', 'ребят', 'всех', 'наших', 'соратников', 'пати', 'друзей']

hl_misc = [
    'дать противоядие', 'очистить', 'снять порчу', 'исцелить от яда', 'кровотечен'
]
# первая часть хила (heal list part 1)
hl_p1 = [
    'хил', 'хилить', 'выхилить', 'отхилить', 'лечение', 'лечить', 'подлечить', 'залечить', 'восстановить',
    'восстановление', 'возродить', 'реснуть', 'воскресить'
]

# первая часть атаки миньонов (minions part 1)
minions_p1 = dl_p1 + ['трепать', 'давить', 'прихлопнуть', 'колотить']
minions_p2 = ['крипов', 'демонов', 'свиту', 'прислужников', 'монстров', 'треш', 'мобов', 'миньонов']

# кнопки выхода из лужи
flame_list = [
    'Отойти от босса', 'Отойти немного', 'Отойти назад', 'Подойти к боссу', 'Подойти вперёд', 'Сделать шаг влево',
    'Сделать шаг вправо', 'Выйти из лужи', 'Сделать шаг в сторону'
]

# кнопки помощи при смертельном ударе
deathpunch_list = ['выручить', 'толкнуть', 'спасти от смерти', 'спасти жизнь', 'помочь выжить']

wakeup = ['взбодрить', 'расшевелить', 'раструсить']

clean = ['очистить', 'исцелить', 'избавить']

concentrate_list = ['сосредоточиться', 'концентрироваться', 'присмотреться']